In [13]:
print("Hello world")

Hello world

In [15]:
import pandas as pd

Veri analizi ve veri manipülasyonu için kullanılan bir kütüphanedir.

# Pandas series

Tek boyutlu bir dizidir. (exceldeki tek bir sütun gibi)

In [19]:
series1 = pd.Series([10,20,30,40,50])
series1

0    10
1    20
2    30
3    40
4    50
dtype: int64

# Pandas DataFrame (Tablo)

Birden fazla sütun içeren bir tablodur

In [22]:
data = { "Ad": ["Ali", "Ayşe", "Mehmet", "Zeynep"], "Yaş":[255,30,35,40], "Şehir":["İstanbul","Ankara", "İzmir","Bursa"]}
data

{'Ad': ['Ali', 'Ayşe', 'Mehmet', 'Zeynep'],
 'Yaş': [255, 30, 35, 40],
 'Şehir': ['İstanbul', 'Ankara', 'İzmir', 'Bursa']}

In [24]:
df1 = pd.DataFrame(data)
df1

       Ad  Yaş     Şehir
0     Ali  255  İstanbul
1    Ayşe   30    Ankara
2  Mehmet   35     İzmir
3  Zeynep   40     Bursa

In [26]:
#CSV dosyası okumak ve bu dosyayı pandas dataframe çevirmek
df2 = pd.read_csv("Chocolate Sales.csv")
df2

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184
...,...,...,...,...,...,...
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,"$6,559",119
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344

In [28]:
type(df2)

pandas.core.frame.DataFrame

In [30]:
type(df1)

pandas.core.frame.DataFrame

In [32]:
#Sadece ilk 5 kayıt
df2.head()

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184

In [34]:
df2["Amount"]

0        $5,320
1        $7,896
2        $4,501
3       $12,726
4       $13,685
          ...
1089     $4,410
1090     $6,559
1091       $574
1092     $2,086
1093     $5,075
Name: Amount, Length: 1094, dtype: object

In [36]:
df2[df2["Boxes Shipped"] > 300]

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
15,Beverie Moffet,Australia,Organic Choco Syrup,26-Jan-22,"$6,790",356
25,Karlen McCaffrey,India,Fruit & Nut Bars,26-Jan-22,$168,321
29,Dennison Crosswaite,New Zealand,Manuka Honey Choco,15-Jun-22,"$5,061",301
35,Roddy Speechley,USA,Manuka Honey Choco,22-Jul-22,"$9,583",315
...,...,...,...,...,...,...
1077,Oby Sorrel,Canada,Orange Choco,27-Apr-22,"$8,757",338
1083,Madelene Upcott,New Zealand,Milk Bars,29-Mar-22,"$12,558",403
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344

In [38]:
df2.isnull()

      Sales Person  Country  Product   Date  Amount  Boxes Shipped
0            False    False    False  False   False          False
1            False    False    False  False   False          False
2            False    False    False  False   False          False
3            False    False    False  False   False          False
4            False    False    False  False   False          False
...            ...      ...      ...    ...     ...            ...
1089         False    False    False  False   False          False
1090         False    False    False  False   False          False
1091         False    False    False  False   False          False
1092         False    False    False  False   False          False
1093         False    False    False  False   False          False

[1094 rows x 6 columns]

In [40]:
df2.isnull().any()

Sales Person     False
Country          False
Product          False
Date             False
Amount           False
Boxes Shipped    False
dtype: bool

#pandas kütüphanesinde 10 adet fonksiyon araştırılıp kullanım örneği olan bir ipynb dosyası ile paylaşılacak

In [43]:
#Veri ön hazırlığı

In [71]:
df3 = pd.read_csv("Chocolate Sales2.csv")

In [73]:
df3.isnull().sum()

Sales Person      0
Country           8
Product          10
Date              9
Amount           11
Boxes Shipped     7
dtype: int64

In [75]:
df3["Country"].mode()[0]  #en çok tekrar eden değerleri döner

'Australia'

In [77]:
df3["Country"] = df3["Country"].fillna(df3["Country"].mode()[0])

In [79]:
df3.isnull().sum()

Sales Person      0
Country           0
Product          10
Date              9
Amount           11
Boxes Shipped     7
dtype: int64

In [85]:
df3["Boxes Shipped"].fillna(df3["Boxes Shipped"].mean(), inplace= True)
df3.isnull().sum()

Sales Person      0
Country           0
Product          10
Date              9
Amount           11
Boxes Shipped     0
dtype: int64

In [87]:
df3.head(5)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",162.062557
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94.000000
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91.000000
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",162.062557
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184.000000

In [89]:
df3["Amount"]

0        $5,320
1        $7,896
2        $4,501
3       $12,726
4       $13,685
          ...
1089     $4,410
1090     $6,559
1091       $574
1092     $2,086
1093     $5,075
Name: Amount, Length: 1094, dtype: object

In [93]:
df3["Amount"] = df3["Amount"].astype(str).str.replace("[$,]", "", regex = True).astype(float)
# $5,320 -> 5320
df3["Amount"]

0        5320.0
1        7896.0
2        4501.0
3       12726.0
4       13685.0
         ...
1089     4410.0
1090     6559.0
1091      574.0
1092     2086.0
1093     5075.0
Name: Amount, Length: 1094, dtype: float64

In [95]:
df3["Amount"].mean()

5667.71837488458

In [101]:
df3["Amount"] = df3["Amount"].fillna(df3["Amount"].mean())
df3.isnull().sum()

Sales Person      0
Country           0
Product          10
Date              9
Amount            0
Boxes Shipped     0
dtype: int64

In [103]:
#forwardfill backwaardfill
df3["Date"] = df3["Date"].ffill().bfill()
df3.isnull().sum()

Sales Person      0
Country           0
Product          10
Date              0
Amount            0
Boxes Shipped     0
dtype: int64

In [105]:
df3.head(12)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,5320.000000,162.062557
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,7896.000000,94.000000
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,4501.000000,91.000000
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,12726.000000,162.062557
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,13685.000000,184.000000
5,Van Tuxwell,India,Smooth Sliky Salty,06-Jun-22,5376.000000,162.062557
6,Oby Sorrel,UK,99% Dark & Pure,25-Jan-22,13685.000000,176.000000
7,Gunar Cockshoot,Australia,After Nines,24-Mar-22,3080.000000,73.000000
8,Jehu Rudeforth,New Zealand,50% Dark Bites,20-Apr-22,3990.000000,59.000000
9,Brien Boise,Australia,99% Dark & Pure,20-Apr-22,5667.718375,102.000000
10,Rafaelita Blaksland,UK,Smooth Sliky Salty,13-Jan-22,4704.000000,62.000000
11,Barr Faughny,USA,Orange Choco,10-Mar-22,3703.000000,162.062557

In [107]:
#product doldururken her bir "sales person" için boş ürünü o kişinin en çok sattığı ürün ile doldurumu

In [115]:
data = {
    "Product": ["A","B","A","B","A","C","C"],
    "Amount": [100,200,250,150,None,300,None]}
df4 = pd.DataFrame(data)

In [117]:
df4["Amount"].mean()

200.0

In [119]:
df4.groupby("Product")["Amount"].mean()

Product
A    175.0
B    175.0
C    300.0
Name: Amount, dtype: float64

In [121]:
df4['Amount'].sum()

1000.0

In [125]:
df4.groupby("Product")["Amount"].sum()

Product
A    350.0
B    350.0
C    300.0
Name: Amount, dtype: float64